# CannotBePasted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PathOfTravelFailures..::..CannotBePasted Property
BuiltInFailures..::..PathOfTravelFailures Class See Also
---
Path of Travel cannot be pasted into this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotBePasted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotBePasted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotBePasted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PathOfTravelFailures Class
Autodesk.Revit.DB Namespace